uhnp/src/Catalogs/СерверыОчередейRMQ/СерверыОчередейRMQ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерверыОчередейRMQ</name>
  <comment>Выполнение задач № 000035594</comment>
  <predefined>
    <items>
      <name>Основной</name>
    </items>
  </predefined>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВиртуальныйХост</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединение</name>
    <comment>// Калинин А. 02.10.2019 Выполнение задач №000033040</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PEMФайлСертификатаУдостоверяющегоЦентра</name>
    <comment>// Калинин А. 02.10.2019 Выполнение задач №000033040</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PEMФайлЗакрытогоКлючаКлиента</name>
    <comment>// Калинин А. 02.10.2019 Выполнение задач №000033040</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PEMФайлСертификатаКлиента</name>
    <comment>// Калинин А. 02.10.2019 Выполнение задач №000033040</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/СерверыОчередейRMQ/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПроверитьСоединениеНаСервере()
	Клиент = ОчередьСообщений.СоздатьЭкземплярКомпоненты();
	// НАЧАЛО Калинин А. 02.10.2019 Выполнение задач №000033040
	Если Объект.ИспользоватьЗащищенноеСоединение Тогда
		Клиент.УстановитьЗащищенноеСоединение(
		    Объект.PEMФайлСертификатаУдостоверяющегоЦентра,
			Объект.PEMФайлЗакрытогоКлючаКлиента,
			Объект.PEMФайлСертификатаКлиента,
			Объект.АдресСервера,
			Объект.Логин,
			Объект.Пароль,
			Объект.Порт,
			Объект.ВиртуальныйХост);
	Иначе
	// КОНЕЦ Калинин А. 02.10.2019 Выполнение задач №000033040	
		Клиент.УстановитьСоединение(
			Объект.АдресСервера,
			Объект.Логин,
			Объект.Пароль,
			Объект.Порт,
			Объект.ВиртуальныйХост);			
	// НАЧАЛО Калинин А. 02.10.2019 Выполнение задач №000033040
	КонецЕсли;
	// КОНЕЦ Калинин А. 02.10.2019 Выполнение задач №000033040			
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	Попытка
		ПроверитьСоединениеНаСервере();
		ПоказатьОповещениеПользователя(НСтр("ru = 'Соединение успешно установлено'"));
	Исключение
		Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
КонецПроцедуры

// Калинин А. 02.10.2019 Выполнение задач №000033040
&НаКлиенте
Процедура ИспользоватьЗащищенноеСоединениеПриИзменении(Элемент)
		
	УстановитьВидимость();
	
КонецПроцедуры

// Калинин А. 02.10.2019 Выполнение задач №000033040
&НаКлиенте
Процедура УстановитьВидимость()

	Элементы.PEMФайлЗакрытогоКлючаКлиента.Видимость 		   = Объект.ИспользоватьЗащищенноеСоединение;
	Элементы.PEMФайлСертификатаКлиента.Видимость 			   = Объект.ИспользоватьЗащищенноеСоединение;
	Элементы.PEMФайлСертификатаУдостоверяющегоЦентра.Видимость = Объект.ИспользоватьЗащищенноеСоединение;	

КонецПроцедуры

// Калинин А. 02.10.2019 Выполнение задач №000033040
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры
